----------------------------------------------------------------
        Layer (type)               Output Shape         Param #
================================================================
            Conv3d-1       [-1, 32, 75, 32, 64]           7,232
       BatchNorm3d-2       [-1, 32, 75, 32, 64]              64
              ReLU-3       [-1, 32, 75, 32, 64]               0
         MaxPool3d-4       [-1, 32, 75, 16, 32]               0
       BatchNorm3d-5       [-1, 32, 75, 16, 32]              64
              ReLU-6       [-1, 32, 75, 16, 32]               0
            Conv3d-7       [-1, 32, 75, 16, 32]           1,024
       BatchNorm3d-8       [-1, 32, 75, 16, 32]              64
              ReLU-9       [-1, 32, 75, 16, 32]               0
           Conv3d-10        [-1, 8, 75, 16, 32]           6,912
      BatchNorm3d-11       [-1, 40, 75, 16, 32]              80
             ReLU-12       [-1, 40, 75, 16, 32]               0
           Conv3d-13       [-1, 32, 75, 16, 32]           1,280
      BatchNorm3d-14       [-1, 32, 75, 16, 32]              64
             ReLU-15       [-1, 32, 75, 16, 32]               0
           Conv3d-16        [-1, 8, 75, 16, 32]           6,912
      BatchNorm3d-17       [-1, 48, 75, 16, 32]              96
             ReLU-18       [-1, 48, 75, 16, 32]               0
           Conv3d-19       [-1, 32, 75, 16, 32]           1,536
      BatchNorm3d-20       [-1, 32, 75, 16, 32]              64
             ReLU-21       [-1, 32, 75, 16, 32]               0
           Conv3d-22        [-1, 8, 75, 16, 32]           6,912
      BatchNorm3d-23       [-1, 56, 75, 16, 32]             112
             ReLU-24       [-1, 56, 75, 16, 32]               0
           Conv3d-25       [-1, 32, 75, 16, 32]           1,792
      BatchNorm3d-26       [-1, 32, 75, 16, 32]              64
             ReLU-27       [-1, 32, 75, 16, 32]               0
           Conv3d-28        [-1, 8, 75, 16, 32]           6,912
      BatchNorm3d-29       [-1, 64, 75, 16, 32]             128
             ReLU-30       [-1, 64, 75, 16, 32]               0
           Conv3d-31       [-1, 64, 75, 16, 32]           4,096
        AvgPool3d-32        [-1, 64, 75, 8, 16]               0
      BatchNorm3d-33        [-1, 64, 75, 8, 16]             128
             ReLU-34        [-1, 64, 75, 8, 16]               0
           Conv3d-35        [-1, 32, 75, 8, 16]           2,048
      BatchNorm3d-36        [-1, 32, 75, 8, 16]              64
             ReLU-37        [-1, 32, 75, 8, 16]               0
           Conv3d-38         [-1, 8, 75, 8, 16]           6,912
      BatchNorm3d-39        [-1, 72, 75, 8, 16]             144
             ReLU-40        [-1, 72, 75, 8, 16]               0
           Conv3d-41        [-1, 32, 75, 8, 16]           2,304
      BatchNorm3d-42        [-1, 32, 75, 8, 16]              64
             ReLU-43        [-1, 32, 75, 8, 16]               0
           Conv3d-44         [-1, 8, 75, 8, 16]           6,912
      BatchNorm3d-45        [-1, 80, 75, 8, 16]             160
             ReLU-46        [-1, 80, 75, 8, 16]               0
           Conv3d-47        [-1, 32, 75, 8, 16]           2,560
      BatchNorm3d-48        [-1, 32, 75, 8, 16]              64
             ReLU-49        [-1, 32, 75, 8, 16]               0
           Conv3d-50         [-1, 8, 75, 8, 16]           6,912
      BatchNorm3d-51        [-1, 88, 75, 8, 16]             176
             ReLU-52        [-1, 88, 75, 8, 16]               0
           Conv3d-53        [-1, 32, 75, 8, 16]           2,816
      BatchNorm3d-54        [-1, 32, 75, 8, 16]              64
             ReLU-55        [-1, 32, 75, 8, 16]               0
           Conv3d-56         [-1, 8, 75, 8, 16]           6,912
      BatchNorm3d-57        [-1, 96, 75, 8, 16]             192
        AvgPool3d-58         [-1, 96, 75, 4, 8]               0
          Dense3D-59         [-1, 96, 75, 4, 8]               0
           Linear-60               [-1, 2, 512]       1,573,376
PositionalEncoding-61              [-1, 2, 512]               0
MultiheadAttention-62       [[-1, 2, 512], [-1, 75, 75]]      0
          Dropout-63               [-1, 2, 512]               0
        LayerNorm-64               [-1, 2, 512]           1,024
           Linear-65               [-1, 2, 512]         262,656
          Dropout-66               [-1, 2, 512]               0
           Linear-67               [-1, 2, 512]         262,656
          Dropout-68               [-1, 2, 512]               0
        LayerNorm-69               [-1, 2, 512]           1,024
TransformerEncoderLayer-70         [-1, 2, 512]               0
MultiheadAttention-71       [[-1, 2, 512], [-1, 75, 75]]      0
          Dropout-72               [-1, 2, 512]               0
        LayerNorm-73               [-1, 2, 512]           1,024
           Linear-74               [-1, 2, 512]         262,656
          Dropout-75               [-1, 2, 512]               0
           Linear-76               [-1, 2, 512]         262,656
          Dropout-77               [-1, 2, 512]               0
        LayerNorm-78               [-1, 2, 512]           1,024
TransformerEncoderLayer-79         [-1, 2, 512]               0
MultiheadAttention-80       [[-1, 2, 512], [-1, 75, 75]]      0
          Dropout-81               [-1, 2, 512]               0
        LayerNorm-82               [-1, 2, 512]           1,024
           Linear-83               [-1, 2, 512]         262,656
          Dropout-84               [-1, 2, 512]               0
           Linear-85               [-1, 2, 512]         262,656
          Dropout-86               [-1, 2, 512]               0
        LayerNorm-87               [-1, 2, 512]           1,024
TransformerEncoderLayer-88         [-1, 2, 512]               0
TransformerEncoder-89              [-1, 2, 512]               0
 TransformerModel-90               [-1, 2, 512]               0
           Linear-91                [-1, 2, 28]          14,364
================================================================
Total params: 3,253,660
Trainable params: 3,253,660
Non-trainable params: 0
----------------------------------------------------------------
Input size (MB): 7.03
Forward/backward pass size (MB): 361.74
Params size (MB): 12.41
Estimated Total Size (MB): 381.19
----------------------------------------------------------------